Get/set if the form is in X-Ray mode.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool IsInXRayMode { get; set; }
  Visual Basic
Public Property IsInXRayMode As Boolean
	Get
	Set
  Visual C++
public:
property bool IsInXRayMode {
	bool get ();
	void set (bool value);
}
 See Also
  Form Class
  Autodesk.Revit.DB Namespace